function solution(letter) {
    // 모스부호 객체
    morse = { 
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
    }
    
    // 입력받은 모스부호 문자열을 공백 기준으로 나눔
    // ['....', '.', '.-..' ..] 배열 생성됨
    let array = letter.split(' ');
    let answer = '';
    
    // 모스부호 객체 안에 해당 무스부호 문자열이 존재하면
    for(let i=0; i<array.length; i++){
        if(morse[array[i]]){
            answer += morse[array[i]];
        }
    }
    return answer;
}